"""В університеті використовується наступна шкала для
інтерпретації результатів тестування студентів:
90 балів і вище (A),
80-89 (B),
70-79 (C),
60-69 (D),
нижче 60 (F).

Напишіть програму, яка дозволить студенту
ввести тестовий бал, а потім відобразити
оцінку для цього балу.

||| курс, Бритвич Олександр Володимирович (ПІБ)"""


# Ініціалізація функції для конвертації числа у відповідну буквенну оцінку
def convert_num_to_letter(points):
    # Перевірка для вказаних діапазонів
    if 90 <= points <= 100:
        print('------------\n', points, '= A\n------------')
    elif 80 <= points <= 89:
        print('------------\n', points, '= B\n------------')
    elif 70 <= points <= 79:
        print('------------\n', points, '= C\n------------')
    elif 60 <= points <= 69:
        print('------------\n', points, '= D\n------------')
    elif 0 <= points <= 60:
        print('------------\n', points, '= F\n------------')
    # Виконується, якщо введено число, що не входить в жоден із вказаних діапазонів
    else:
        print("Введено некоректну кількість баллів. Будь ласка, введіть число від 0 до 100.")


# Безкінечний цикл для повторення програми
while True:
    # Отримаємо на вхід від користувача кільківсть балів від 0 до 100
    user_input = input('Введіть кількість баллів (0-100). Для закінчення програми введіть слово "stop": ')

    # Перевірка, чи користувач ввів слово "stop" для завершення програми
    if user_input.lower() == 'stop':
        print('Програма завершена.')
        break

    try:
        # Перетворюємо введене число в тип int
        number_of_points = int(user_input)
        # Виклик функції для конвертації числа в буквенну оцінку
        convert_num_to_letter(number_of_points)
    # Виводимо повідомлення про помилку, якщо введено нечислове значення
    except ValueError:
        print('\nВведено некоректні дані. Будь ласка, введіть число або слово "stop".')
