"""Тетянка полюбляє їздити у громадському транспорті,
а отримуючи квиток, відразу перевіряє, чи він щасливий.
Квиток вважається щасливим, якщо сума перших трьох цифр
збігається з сумою останніх трьох цифр номера квитка.

Напишіть програму, яка перевірить рівність сум і виведе
Happy
, якщо суми збігаються, і
Ordinary
, якщо суми різні.
На вхід програмі подається рядок із шести цифр.

||| курс, Бритвич Олександр Володимирович (ПІБ)"""

# Ініціалізація безкінечного циклу
while True:

    try:
        # Введення 6 чисел в рядку, розділених пробілами
        num1, num2, num3, num4, num5, num6 = map(int, input("Введіть 6 чисел: ").split())
    except ValueError:
        # Обробка винятку, якщо введені дані не можуть бути перетворені в цілі числа
        print('Ви не ввели потрібну кількість чисел. Будь-ласка, введіть 6 чисел.')
        # Перехід на наступну ітерацію циклу
        continue

    # Обчислення сум чисел у двох групах
    sum_1 = num1 + num2 + num3
    sum_2 = num4 + num5 + num6

    # Порівняння сум груп
    if sum_1 == sum_2:
        print('Happy')
    else:
        print('Ordinary')
